# =============================================================================
# Homebrew Taps
# =============================================================================

# Spring Boot CLI and tools
tap "spring-io/tap"

# Bell Software's Liberica JDK distributions
tap "bell-sw/liberica"

# =============================================================================
# Version Control
# =============================================================================

# Distributed version control system
brew "git"

# GitHub CLI - manage GitHub from the command line
brew "gh"

# =============================================================================
# Development Tools & Languages
# =============================================================================

# Java environment manager - manage multiple Java versions
brew "jenv"

# Node.js JavaScript runtime
brew "nodejs"

# Fast, reliable, and secure dependency management for JavaScript
brew "yarn"

# Next generation frontend tooling for modern web development
brew "vite"

# GNU Privacy Guard - encryption and signing tool
brew "gnupg"

# =============================================================================
# Build Tools
# =============================================================================

# Apache Maven - Java project management and build tool
brew "maven"

# Gradle build automation system
brew "gradle"

# =============================================================================
# Cloud & Container Tools
# =============================================================================

# Kubernetes command-line tool
brew "kubernetes-cli"

# Kubernetes package manager
brew "helm"

# =============================================================================
# Spring Framework Tools
# =============================================================================

# Spring Boot CLI - command line interface for Spring Boot
brew "spring-boot"

# =============================================================================
# Utilities
# =============================================================================

# Modern HTTP client - user-friendly cURL alternative
brew "httpie"

# Lightweight command-line JSON processor
brew "jq"

# =============================================================================
# Terminal Emulators
# =============================================================================

# Modern terminal emulator for macOS with advanced features
cask "iterm2"

# =============================================================================
# Java Development Kits (JDKs)
# =============================================================================

# Liberica JDK distributions - open-source Java runtime
cask "liberica-jdk25"  # Latest LTS version
cask "liberica-jdk21"  # LTS - Sept 2023
cask "liberica-jdk17"  # LTS - Sept 2021
cask "liberica-jdk11"  # LTS - Sept 2018
cask "liberica-jdk8"   # LTS - March 2014

# GraalVM JDK - high-performance JDK with native compilation
cask "graalvm-jdk@17"  # GraalVM based on JDK 17
cask "graalvm-jdk@21"  # GraalVM based on JDK 21
cask "graalvm-jdk"     # Latest GraalVM JDK

# =============================================================================
# AI & Development Tools
# =============================================================================

# Google's Gemini AI CLI tool
brew "gemini-cli"

# Anthropic's Claude AI CLI assistant
cask "claude-code"

# AI-powered code assistant
cask "codex"

# =============================================================================
# Containerization & Virtualization
# =============================================================================

# Docker Desktop - containerization platform
cask "docker-desktop"
