tap "graalvm/tap"
tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/core"
tap "hashicorp/tap"
tap "homebrew/services"
tap "homebrew/cask-versions"
brew "git"
brew "httpie"
brew "jenv"
brew "jq"
brew "maven"
brew "kubeseal"
brew "minikube"
brew "kubernetes-cli"
brew "helm"
brew "nodejs"
brew "yarn"
brew "gradle"
brew "dive"
brew "golang"
brew "pulumi"
brew "argocd"
brew "vite"
brew "vault"
cask "google-cloud-sdk"
cask "iterm2"
cask "temurin"
cask "temurin11"
cask "temurin17"
cask "temurin19"
cask "temurin21"
cask "graalvm-community-jdk17"
cask "graalvm-community-jdk21"
