tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
brew "git"
brew "httpie"
brew "jenv"
brew "jq"
brew "maven"
brew "kubeseal"
brew "minikube"
brew "kubernetes-cli"
brew "helm"
brew "nodejs"
brew "yarn"
brew "gradle"
brew "dive"
brew "golang"
brew "pulumi"
brew "argocd"
brew "vite"
brew "hashicorp/tap/vault"
brew "azure-cli"
cask "google-cloud-sdk"
cask "iterm2"
cask "temurin"
cask "temurin@11"
cask "temurin@17"
cask "temurin@19"
cask "temurin@21"
cask "graalvm-community-jdk17"
cask "graalvm-community-jdk21"
cask "graalvm-community-jdk23"

